cases/openfoam/fixed_cylinder/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   Operation     | Version: 10
    \\  /    And           |
     \/     Manipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

// Re = U_inf*D/nu = 1*1/0.01 = 100.
nu              [0 2 -1 0 0 0 0] 0.01;

// rhoInf is declared in the force function objects.  icoFoam solves
// kinematic pressure; rhoInf converts the integrated force to newtons.

// ************************************************************************* //
