cases/openfoam/fixed_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       10048;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       10112;
    }
    lower
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          64;
        startFace       10176;
    }
    upper
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          64;
        startFace       10240;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          128;
        startFace       10304;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          10240;
        startFace       10432;
    }
)

// ************************************************************************* //
