cases/openfoam/fixed_cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   Operation     | Version: 10
    \\  /    And           |
     \/     Manipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// D=1, cylinder radius=0.5, near-field radial block radius=0.8.
// z=-0.5..0.5 is a finite unit span; front/back faces are empty.
vertices
(
    ( 0.5       0         -0.5)
    ( 0.8       0         -0.5)
    (10.0       0         -0.5)
    (10.0       0.565685 -0.5)
    ( 0.565685   0.565685 -0.5)
    ( 0.353553   0.353553 -0.5)
    (10.0       5         -0.5)
    ( 0.8       5         -0.5)
    ( 0         5         -0.5)
    ( 0         0.8       -0.5)
    ( 0         0.5       -0.5)
    (-0.5       0         -0.5)
    (-0.8       0         -0.5)
    (-5.0       0         -0.5)
    (-5.0       0.565685 -0.5)
    (-0.565685   0.565685 -0.5)
    (-0.353553   0.353553 -0.5)
    (-5.0       5         -0.5)
    (-0.8       5         -0.5)
    (10.0      -0.565685 -0.5)
    ( 0.565685  -0.565685 -0.5)
    ( 0.353553  -0.353553 -0.5)
    (10.0      -5         -0.5)
    ( 0.8      -5         -0.5)
    ( 0        -5         -0.5)
    ( 0        -0.8       -0.5)
    ( 0        -0.5       -0.5)
    (-5.0      -0.565685 -0.5)
    (-0.565685  -0.565685 -0.5)
    (-0.353553  -0.353553 -0.5)
    (-5.0      -5         -0.5)
    (-0.8      -5         -0.5)

    ( 0.5       0          0.5)
    ( 0.8       0          0.5)
    (10.0       0          0.5)
    (10.0       0.565685  0.5)
    ( 0.565685   0.565685  0.5)
    ( 0.353553   0.353553  0.5)
    (10.0       5          0.5)
    ( 0.8       5          0.5)
    ( 0         5          0.5)
    ( 0         0.8        0.5)
    ( 0         0.5        0.5)
    (-0.5       0          0.5)
    (-0.8       0          0.5)
    (-5.0       0          0.5)
    (-5.0       0.565685  0.5)
    (-0.565685   0.565685  0.5)
    (-0.353553   0.353553  0.5)
    (-5.0       5          0.5)
    (-0.8       5          0.5)
    (10.0      -0.565685  0.5)
    ( 0.565685  -0.565685  0.5)
    ( 0.353553  -0.353553  0.5)
    (10.0      -5          0.5)
    ( 0.8       -5          0.5)
    ( 0        -5          0.5)
    ( 0        -0.8        0.5)
    ( 0        -0.5        0.5)
    (-5.0      -0.565685  0.5)
    (-0.565685  -0.565685  0.5)
    (-0.353553  -0.353553  0.5)
    (-5.0      -5          0.5)
    (-0.8      -5          0.5)
);

blocks
(
    hex (5 4 9 10 37 36 41 42) (16 16 1) simpleGrading (1 1 1)
    hex (0 1 4 5 32 33 36 37) (16 16 1) simpleGrading (1 1 1)
    hex (1 2 3 4 33 34 35 36) (16 16 1) simpleGrading (1 1 1)
    hex (4 3 6 7 36 35 38 39) (16 16 1) simpleGrading (1 1 1)
    hex (9 4 7 8 41 36 39 40) (16 16 1) simpleGrading (1 1 1)
    hex (15 16 10 9 47 48 42 41) (16 16 1) simpleGrading (1 1 1)
    hex (12 11 16 15 44 43 48 47) (16 16 1) simpleGrading (1 1 1)
    hex (13 12 15 14 45 44 47 46) (16 16 1) simpleGrading (1 1 1)
    hex (14 15 18 17 46 47 50 49) (16 16 1) simpleGrading (1 1 1)
    hex (15 9 8 18 47 41 40 50) (16 16 1) simpleGrading (1 1 1)
    hex (26 25 20 21 58 57 52 53) (16 16 1) simpleGrading (1 1 1)
    hex (21 20 1 0 53 52 33 32) (16 16 1) simpleGrading (1 1 1)
    hex (20 19 2 1 52 51 34 33) (16 16 1) simpleGrading (1 1 1)
    hex (23 22 19 20 55 54 51 52) (16 16 1) simpleGrading (1 1 1)
    hex (24 23 20 25 56 55 52 57) (16 16 1) simpleGrading (1 1 1)
    hex (28 29 11 12 60 61 43 44) (16 16 1) simpleGrading (1 1 1)
    hex (25 26 29 28 57 58 61 60) (16 16 1) simpleGrading (1 1 1)
    hex (27 28 12 13 59 60 44 45) (16 16 1) simpleGrading (1 1 1)
    hex (30 31 28 27 62 63 60 59) (16 16 1) simpleGrading (1 1 1)
    hex (31 24 25 28 63 56 57 60) (16 16 1) simpleGrading (1 1 1)
);

edges
(
    arc 5 0 (0.461940 0.191342 -0.5)
    arc 5 10 (0.191342 0.461940 -0.5)
    arc 1 4 (0.739104 0.306147 -0.5)
    arc 4 9 (0.306147 0.739104 -0.5)
    arc 32 37 (0.461940 0.191342 0.5)
    arc 37 42 (0.191342 0.461940 0.5)
    arc 33 36 (0.739104 0.306147 0.5)
    arc 36 41 (0.306147 0.739104 0.5)
    arc 11 16 (-0.461940 0.191342 -0.5)
    arc 16 10 (-0.191342 0.461940 -0.5)
    arc 12 15 (-0.739104 0.306147 -0.5)
    arc 15 9 (-0.306147 0.739104 -0.5)
    arc 43 48 (-0.461940 0.191342 0.5)
    arc 48 42 (-0.191342 0.461940 0.5)
    arc 44 47 (-0.739104 0.306147 0.5)
    arc 47 41 (-0.306147 0.739104 0.5)
    arc 0 21 (0.461940 -0.191342 -0.5)
    arc 21 26 (0.191342 -0.461940 -0.5)
    arc 1 20 (0.739104 -0.306147 -0.5)
    arc 20 25 (0.306147 -0.739104 -0.5)
    arc 32 53 (0.461940 -0.191342 0.5)
    arc 53 58 (0.191342 -0.461940 0.5)
    arc 33 52 (0.739104 -0.306147 0.5)
    arc 52 57 (0.306147 -0.739104 0.5)
    arc 11 29 (-0.461940 -0.191342 -0.5)
    arc 29 26 (-0.191342 -0.461940 -0.5)
    arc 12 28 (-0.739104 -0.306147 -0.5)
    arc 28 25 (-0.306147 -0.739104 -0.5)
    arc 43 61 (-0.461940 -0.191342 0.5)
    arc 61 58 (-0.191342 -0.461940 0.5)
    arc 44 60 (-0.739104 -0.306147 0.5)
    arc 60 57 (-0.306147 -0.739104 0.5)
);

defaultPatch
{
    name defaultFaces;
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (17 14 46 49)
            (14 13 45 46)
            (13 27 59 45)
            (27 30 62 59)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (22 19 51 54)
            (19 2 34 51)
            (2 3 35 34)
            (3 6 38 35)
        );
    }
    lower
    {
        type symmetryPlane;
        faces
        (
            (30 31 63 62)
            (31 24 56 63)
            (24 23 55 56)
            (23 22 54 55)
        );
    }
    upper
    {
        type symmetryPlane;
        faces
        (
            (6 7 39 38)
            (7 8 40 39)
            (8 18 50 40)
            (18 17 49 50)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (0 5 37 32)
            (5 10 42 37)
            (10 16 48 42)
            (16 11 43 48)
            (11 29 61 43)
            (29 26 58 61)
            (26 21 53 58)
            (21 0 32 53)
        );
    }
);

// ************************************************************************* //
