cases/openfoam/fixed_cylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   Operation     | Version: 10
    \\  /    And           |
     \/     Manipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-09;
        relTol          0;
    }
}

PISO
{
    nCorrectors                 2;
    nNonOrthogonalCorrectors    0;
    pRefCell                     0;
    pRefValue                    0;
}

// ************************************************************************* //
