cases/openfoam/fixed_cylinder/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   Operation     | Version: 10
    \\  /    And           |
     \/     Manipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volVectorFieldValue U (1 0 0)
);

regions
(
    boxToCell
    {
        box (0.5 -0.4 -0.5) (2.0 0.4 0.5);
        fieldValues
        (
            volVectorFieldValue U (1 0.1 0)
        );
    }
);

// ************************************************************************* //
